#### Import the neccesary librariries for data wrangling

In [1]:
import pandas as pd
import numpy as np

#### Reading Data

In [2]:
# Example 1
df = pd.read_csv("http://bit.ly/IrisDataset")
df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [3]:
# Example 2
df_cities = pd.read_csv('http://bit.ly/CitiesDataset1')

df_cities.head()

       city         country  latitude  longitude  temperature
0   Aalborg         Denmark     57.03       9.92         7.52
1  Aberdeen  United Kingdom     57.17      -2.08         8.10
2    Abisko          Sweden     63.35      18.83         0.20
3     Adana          Turkey     36.99      35.32        18.67
4  Albacete           Spain     39.00      -1.87        12.62

In [4]:
# Example 3
df_hotels = pd.read_csv("https://bit.ly/HotelBookingsDB")

df_hotels.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,NaN,0,Transient,98.0,0,1,Check-Out,2015-07-03

In [5]:
# Example 4
df_windmill = pd.read_excel('http://bit.ly/WindmillDataset')

df_windmill.head()

  Windmill  Wind Speed (m/s)  Power output (MW)
0       a1          1.096875           0.000000
1       a2          1.231528           0.000000
2       a3          1.275139           0.005479
3       a4          1.365486           0.010104
4       a5          1.387778           0.010812

#### Data Exploration

In [6]:
df_hotels.tail()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
119385,City Hotel,0,23,2017,August,35,30,2,5,2,...,No Deposit,394.0,NaN,0,Transient,96.14,0,0,Check-Out,2017-09-06
119386,City Hotel,0,102,2017,August,35,31,2,5,3,...,No Deposit,9.0,NaN,0,Transient,225.43,0,2,Check-Out,2017-09-07
119387,City Hotel,0,34,2017,August,35,31,2,5,2,...,No Deposit,9.0,NaN,0,Transient,157.71,0,4,Check-Out,2017-09-07
119388,City Hotel,0,109,2017,August,35,31,2,5,2,...,No Deposit,89.0,NaN,0,Transient,104.40,0,0,Check-Out,2017-09-07
119389,City Hotel,0,205,2017,August,35,29,2,7,2,...,No Deposit,9.0,NaN,0,Transient,151.20,0,2,Check-Out,2017-09-07

In [7]:
df.shape

(150, 5)

In [8]:
df_hotels.shape

(119390, 32)

In [9]:
df_hotels.sample(6)

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
101461,City Hotel,0,2,2016,November,46,6,2,5,2,...,No Deposit,27.0,NaN,0,Transient,78.20,0,1,Check-Out,2016-11-13
57616,City Hotel,1,447,2016,September,40,29,0,2,2,...,Non Refund,1.0,NaN,0,Transient,62.00,0,0,Canceled,2015-10-21
16498,Resort Hotel,0,0,2015,August,35,29,1,1,2,...,No Deposit,240.0,NaN,0,Transient,120.60,0,1,Check-Out,2015-08-31
108918,City Hotel,0,162,2017,April,13,1,2,1,2,...,No Deposit,296.0,NaN,105,Transient-Party,88.20,0,0,Check-Out,2017-04-04
20939,Resort Hotel,0,4,2016,February,7,13,0,1,2,...,No Deposit,250.0,NaN,0,Transient,55.00,0,1,Check-Out,2016-02-14
93879,City Hotel,0,190,2016,July,31,24,2,2,2,...,No Deposit,9.0,NaN,0,Transient,99.95,1,1,Check-Out,2016-07-28

In [10]:
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [11]:
df_hotels.dtypes

hotel                              object
is_canceled                         int64
lead_time                           int64
arrival_date_year                   int64
arrival_date_month                 object
arrival_date_week_number            int64
arrival_date_day_of_month           int64
stays_in_weekend_nights             int64
stays_in_week_nights                int64
adults                              int64
children                          float64
babies                              int64
meal                               object
country                            object
market_segment                     object
distribution_channel               object
is_repeated_guest                   int64
previous_cancellations              int64
previous_bookings_not_canceled      int64
reserved_room_type                 object
assigned_room_type                 object
booking_changes                     int64
deposit_type                       object
agent                             float64
company                           float64
days_in_waiting_list                int64
customer_type                      object
adr                               float64
required_car_parking_spaces         int64
total_of_special_requests           int64
reservation_status                 object
reservation_status_date            object
dtype: object

#### Standardisation

In [12]:
# We will be using the data cleaning dataset
df_dataclean = pd.read_csv('http://bit.ly/DataCleaningDataset')

df_dataclean.head()

  NAME;CITY;COUNTRY;HEIGHT;WEIGHT;ACCOUNT A;ACCOUNT B;TOTAL ACCOUNT
0  Adi Dako ;LISBON    ;PORTUGAL     ;56;132;2390...
1  John Paul;LONDON   ;UNITED KINGDOM;62;165;4500...
2     Cindy Jules;Stockholm;Sweden;48;117;;5504;8949
3      Arthur Kegels;BRUSSELS;BELGIUM;59;121;4344...
4  Freya Bismark;  Berlin;GERMANYY;53;126;7000;19...

In [13]:
# specifying the separator ';' when loading the dataset
df_dataclean = pd.read_csv('http://bit.ly/DataCleaningDataset', ';')

df_dataclean.head()

/opt/conda/envs/Python-3.9/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: In a future version of pandas all arguments of read_csv except for the argument 'filepath_or_buffer' will be keyword-only
  exec(code_obj, self.user_global_ns, self.user_ns)

,NAME,CITY,COUNTRY,HEIGHT,WEIGHT,ACCOUNT A,ACCOUNT B,TOTAL ACCOUNT
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [14]:
# Renaming the columns using .strip(), .lower() and .replace()
df_dataclean.columns = df_dataclean.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

df_dataclean.head()

/tmp/wsuser/ipykernel_210/1645267019.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df_dataclean.columns = df_dataclean.columns.str.strip().str.lower().str.replace(' ', '_').str.replace('(', '').str.replace(')', '')

,name,city,country,height,weight,account_a,account_b,total_account
0,Adi Dako,LISBON,PORTUGAL,56,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,62,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,48,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,59,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,53,126.0,7000.0,19000,26000

In [15]:
# Type conversion
# height from inches to cm
df_dataclean['height'] = df_dataclean['height']*2.54
df_dataclean.head()

,name,city,country,height,weight,account_a,account_b,total_account
0,Adi Dako,LISBON,PORTUGAL,142.24,132.0,2390.0,4340,6730
1,John Paul,LONDON,UNITED KINGDOM,157.48,165.0,4500.0,34334,38834
2,Cindy Jules,Stockholm,Sweden,121.92,117.0,NaN,5504,8949
3,Arthur Kegels,BRUSSELS,BELGIUM,149.86,121.0,4344.0,8999,300
4,Freya Bismark,Berlin,GERMANYY,134.62,126.0,7000.0,19000,26000

In [16]:
df_dataclean.dtypes

name              object
city              object
country           object
height           float64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [18]:
# Type conversion
# height to integer using .apply() function by numpy
df_dataclean['height'] = df_dataclean['height'].apply(np.int64)
df_dataclean.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a        float64
account_b          int64
total_account      int64
dtype: object

In [19]:
# Type conversion
# account_a to integer using .apply() function by numpy
# first replace Nan values with zero
df_dataclean['account_a'] = df_dataclean['account_a'].fillna(0)

df_dataclean['account_a'] = df_dataclean['account_a'].apply(np.int64)

df_dataclean.dtypes

name              object
city              object
country           object
height             int64
weight           float64
account_a          int64
account_b          int64
total_account      int64
dtype: object